package calculators

// Тут будел функция объем инфузии при ожогах
/*
Формула Эванса
Формула, предложена в 1952 г. и основана на экспериментальных данных, выражается следующим образом:
2 мл * (m * p) + 2000 мл,
где p – процент обожженной поверхности тела, m – масса тела пациента.
Формула применяется в 1-й день после поражения. На 2-й день количество переливаемого объема уменьшается вдвое. Коллоидные растворы (плазма, альбумин, декстран, кровь)
переливаются в количестве (m * p) мл, в таком же количестве (m * p) мл переливаются растворы электролитов (раствор Рингера, полиионная жидкость, 0,9 % раствор хлорида натрия) и
2000 мл раствора глюкозы для покрытия расходов на испарение. Формула Эванса позволяет покрыть все потребности в жидкости у тяжелообожженного со следующей оговоркой автора:
а) при ожогах, превышающих 45–50 % поверхности тела, расчетная величина не должна превышать потребностей для 50 %;
б) объем переливаемой жидкости больным старше 50 лет должен быть несколько меньше, чтобы не вызвать перегрузку сердечно-сосудистой системы.
Формула Военно-медицинского центра в г. Бруке (Brooke)
Формула предложена в 1953 г., представляет собой модификацию формулы Эванса, в которой объем переливаемых коллоидных растворов сокращен наполовину: 0.5 мл * (m * p),
но увеличен объем электролитов: 1.5 мл * (m * p). Во всех других отношениях формула остается такой же, с теми же оговорками.
Формула Кристоля – Берлинга (Cristol, Berling)
По формуле, предложенной в 1961 г. во Франции, пациентом с ожоговым шоком рекомендуется переливать коллоидные растворы в количестве 0.5 мл * (m * p), а глюкозы и
 электролитов – в стандартном объеме 2500 мл.
Формула Мейера (Моуеr)
Формула (диета Паркланда) выглядит следующим образом: 4 мл * (m * p). По этой формуле в оригинале переливаются только растворы электролитов в виде раствора Рингера,
 подщелоченного лактатом натрия до рН 8,2. На 2-й день объем жидкости уменьшают наполовину.
*/
